import os
from dotenv import load_dotenv


load_dotenv()

items = os.getenv('ITEMS')
sum = os.getenv('SUM')
order_num = os.getenv('ORDER_NUM')
print(items, sum, order_num)

# 1. Поменяем № очереди с суммой местами.
print('1.', items, order_num, sum)

# 2. Посчитаем среднюю стоимсть каждой пиццы в заказе.
print('2. Средняя стоимсть каждой пиццы в заказе:', float(sum)/int(items))

# 3. В сумме заказа уже имеется дробь, но можно использовать команду "float".
print('3.', float(sum))

# 4. У клиента в номере заказа есть цифра 2, ему положена скидка в 50%:
print('4. Поздравляем! \nВы нарвались на аттракцион невиданной щедрости, '
      'и вам положена скидка 50%. \nСтоимость Вашего заказа составит',
      float(sum)*50/100)

# 5. Хотя колличество пицц в заказе составляет больше 2, номер в очереди
# сократим на 5. Сделать это можно следующим образом:
print('5.', round(float(order_num)/5))
